{
  "Search Address / Block / Contract / Tipset / Transaction CID in ": "Buscar Address / Bloque / Contrato / Tipset / CID de Transacción en ",
  "Search": "Buscar",
  "Unlocking the Power of Blockchain Developers with Beryx!": "Potenciando el talento de los desarrolladores de Blockchain con Beryx.",
  "Start by searching your smart contract, transaction, address or using one of the examples below.": "Comienza buscando tu contrato inteligente, transacción, dirección o utilizando uno de los ejemplos proporcionados.",
  "Developed by": "Desarrollado por ",
  "Latest Tipsets and Transactions": "Últimos Tipsets y Transacciones",
  "Stay up to date with the latest happenings in the world of Filecoin! In this section, we'll provide you with a quick overview of the most recent tipsets and transactions.": "¡Mantente al día con las últimas novedades en el mundo de Filecoin! En esta sección, te proporcionaremos un resumen rápido de los bloques y transacciones más recientes.",
  "Go to Recent Activity": "Acceder a Actividad Reciente",
  "Loading latest tipsets": "Cargando los tipsets más recientes.",
  "Loading latest transactions": "Cargando las transacciones más recientes.",
  "Latest Tipsets": "Últimos Tipsets",
  "Latest Tipset": "Último Tipset",
  "Latest Transactions": "Últimas Transacciones",
  "Latest Contracts Invokes": "Últimos Contratos Invocados",
  "Explore Beryx API": "Descubre el API de Beryx",
  "Beryx indexes and exposes via a public API Filecoin historical and real-time data. We provide historical transactions of every account, interactions with multisig accounts, fees details and many more.": "Beryx indexa y expone datos históricos y en tiempo real de Filecoin a través de un API pública. Brindamos información sobre transacciones históricas de cada cuenta, interacciones con cuentas multisig, detalles de comisiones de gas y mucho más.",
  "Get free token": "Obten un token gratis",
  "Visit documentation": "Visita la documentación",
  "Dont forget that in order to access the Beryx API, youll need an API token.": "Recuerda que para acceder a la API de Beryx necesitarás un token de la API.",
  "Navigate the Filecoin Blockchain while discovering Beryx API endpoints": "Explora/Navega la cadena de bloques de Filecoin mientras descubres los endpoints de la API de Beryx",
  "Have a bug to report or a feature request?": "¿Has encontrado un error o te gustaría pedirnos una funcionalidad nueva?",
  "We would like to know your opinion. See the arrow? Click over there to send feedback": "Nos gustaría conocer tu opinión. ¿Ves la flecha? Haz clic aquí para enviar tus comentarios.",
  "We would like to know your opinion. Please accept cookies to share your feedback with us.": "Nos gustaría conocer tu opinión. Por favor, acepta las cookies para compartir tus comentarios.",
  "Search examples": "Ejemplos de búsqueda",
  "Developer Resources": "Recursos para desarrolladores",
  "See more": "Ver más",
  "minutes": "minutos",
  "seconds": "segundos",
  "hours": "horas",
  "minute": "minuto",
  "home.interactionTutorialPartOne": "Sección de interacción",
  "home.interactionTutorialPartTwo": "se ha movido",
  "home.interactionTutorialSecondLine": "En nuestra última actualización, mejoramos la experiencia de interacción del contrato.",
  "home.interactionTutorialThirdLine": "Para probar tu contrato, simplemente búscalo por su dirección. Justo allí, en la vista de resultados, podrás llamar a métodos, ver y subir su ABI, y observar estadísticas en vivo.",
  "Try it": "Pruébalo",
  "Powerful resources": "Importante recursos",
  "update": "nuevo",
  "news": "noticia",
  "Settings": "Configuración",
  "Language": "Idioma",
  "Theme": "Modo",
  "Light": "Claro",
  "Dark": "Oscuro",
  "English": "Inglés",
  "Spanish": "Español",
  "Currency": "Moneda",
  "Column": "Columna",
  "Filters": "Filtros",
  "Export": "Exportar",
  "Latest Block": "Último Bloque",
  "Height": "Altura",
  "table.miners": "Mineros",
  "table.hash": "Hash",
  "table.from": "De/Origen",
  "table.method": "Método",
  "Address converter": "Conversor de Addresses",
  "Type in a Filecoin Address to see its Ethereum version and vice versa.": "Ingresa una dirección de Filecoin para ver su versión de Ethereum y viceversa.",
  "Type in an Ethereum Address to see its Filecoin version and vice versa.": "Ingresa una dirección de Ethereum para ver su versión de Filecoin y viceversa.",
  "Convert to ": "Convertir a ",
  "Ethereum address": "Address de Ethereum",
  "Filecoin address": "Address de Filecoin",
  "Invalid address": "Address inválida",
  "Verify your Smart Contract": "Verificación de tu contrato inteligente",
  "Source code verification provides transparency for users interacting with smart contracts.": "La verificación del código fuente proporciona transparencia a los usuarios que interactúan con contratos inteligentes.",
  "Latest Verified Contracts": "Últimos contratos verificados",
  "Contract address": "Address del contrato",
  "Contract Address": "Address del Contrato",
  "We currently do not offer support for upgradable and proxy contracts.": "Actualmente no ofrecemos soporte para contratos actualizables y de proxy.",
  "Download Code": "Descargar código",
  "Verify contract": "Verificar contrato",
  "Network": "Network",
  "Source Code": "Código Fuente",
  "Upload *.zip or *.sol file *": "Subir archivo *.zip o *.sol *",
  "Uploaded file": "Archivo cargado",
  "Do you have a metadata .json file?": "¿Tienes un archivo de metadata .json?",
  "contractVerifier.form.metadata": "Metadata",
  "Upload your metadata from a *.json file": "Sube tu metadata desde un archivo *.json.",
  "Uploaded metadata file": "Archivo de metadata cargado",
  "Source Contract File *": "Archivo del Contrato Fuente *",
  "Select License *": "Seleccionar licencia *",
  "Contract Name": "Nombre del contrato",
  "Select Compiler Version *": "Seleccionar la versión del compilador *",
  "Optimize": "Optimizar",
  "Number of runs": "Número de ejecuciones",
  "I agree with the": "Acepto los",
  "Terms and Conditions": "Términos y Condiciones",
  "How to use": "Cómo usar",
  "Verifying a contract means that we&apos;ll check for you if the source code provided is matching the bytecode from the blockchain.": "Verificar un contrato significa que revisaremos si el código fuente proporcionado coincide con el bytecode de la blockchain.",
  "Steps to verify a contract:": "Pasos para verificar un contrato:",
  "Upload the source code": "Sube el código fuente",
  "You have to upload the source code. This can be either a single .sol file, or in case you have a more complex contract, then please compress it into a .zip format and then upload it.": "Debes subir el <span id='bold'>código fuente</span>. Puede ser un archivo <span id='bold'>.sol</span> individual, o en caso de que tengas un contrato más complejo, comprímelo en formato <span id='bold'>.zip</span> y luego súbelo.",
  "Upload the metadata file": "Sube el archivo de metadata",
  "Select if you have a metadata .json file or not. This file can be found in Remix after you compiled a contract and it contains the metadata from the output of Solidity compilation: compiler version, license, number of optimization steps, etc. What happens if:": "Selecciona si tienes un archivo metadata <span id='bold'>.json</span> o no. Este archivo se puede encontrar en Remix después de compilar un contrato y contiene la metadata de la salida de la compilación de Solidity: versión del compilador, licencia, número de pasos de optimización, etc. ¿Qué sucede si: ",
  "I have the file": "Tengo el archivo",
  "Upload the .json file and you are all set.": "Sube el archivo .json y listo.",
  "I don&apos;t have the file": "No tengo el archivo",
  "Source Code Not Verified": "Código fuente no verificado",
  "The contract couldn't be verified": "El contrato no pudo ser verificado",
  "The reason is": "La razón es",
  "You have to specify the entry file name, the compiler version, the license and the desired optimization.": "Debes especificar el nombre del archivo de entrada, la versión del compilador, la licencia y la optimización deseada.",
  "Verify the contract": "Verifica el contrato",
  "If all information is set, then the button will turn blue, which means you are ready to verify your contract.": "Si toda la información está establecida, el botón se pondrá azul, lo que significa que estás listo para verificar tu contrato.",
  "Example of metadata file with minimal requirements.": "Ejemplo de archivo de la metadata con requisitos mínimos.",
  "You have to upload the": "Debes descargar el ",
  "Verify": "Verificar",
  "Terms & Conditions": "Términos y condiciones",
  "Privacy Policy": "Política de privacidad",
  "Cookies Settings": "Configuración de cookies",
  "Interact with a smart": "Interactúa con un",
  "contract": "contrato inteligente",
  "transaction": "transacción",
  "In our latest update we improved the contract interaction experience.": "En nuestra última actualización, mejoramos la experiencia de interacción con contratos.",
  "To test your contract just search it by its address. Right there, in the results view you&apos;ll be able to call methods, view and upload its ABI and watch live insights.": "Para probar tu contrato puedes buscarlo por su address. En la vista de resultados, podrás llamar a métodos, ver y subir su ABI y observar información en tiempo real.",
  "Calibration testnet is now supported in Beryx": "La red testnet de Calibration ahora es compatible con Beryx",
  "At the end of May the Filecoin Hyperspace testnet will be discontinued permanently in favor of Calibration testnet.": "A partir de finales de mayo, la red testnet de Filecoin Hyperspace se descontinuará permanentemente y se comenzará a utilizar la red testnet de Calibration.",
  "More info about Calibration testnet can be found in the Filecoin Docs.": "Puedes encontrar más información sobre la red testnet de Calibration en la documentación de Filecoin.",
  "Switch network": "Cambiar de red",
  "Learn more": "Obtener más información",
  "Connect to MetaMask": "Conectar a MetaMask",
  "Close": "Cerrar",
  "Done": "Hecho",
  "Confirmed": "Confirmado",
  "Not Confirmed": "No confirmado",
  "Yes": "Sí",
  "Learn how to interact with a contract": "Aprende cómo interactuar con un contrato",
  "Learn in 5 easy steps how to use the interact section to test your smart contract.": "Aprende en 5 sencillos pasos cómo utilizar la sección 'Interactuar' para probar tu contrato inteligente.",
  "We decode the contract functions for you from its bytecode. Based on it you will be able to select what methods to call.": "Decodificamos las funciones del contrato a partir de su bytecode. Con esto, podrás seleccionar qué métodos llamar.",
  "There is also the possibility to upload the ABI by verifying your contract.": "También existe la posibilidad de cargar el ABI al verificar tu contrato.",
  "Select a method": "Seleccionar un método",
  "Methods are grouped by type. Therefore, select a type and then the method.": "Los métodos están agrupados por tipo. Por lo tanto, debes elegir un tipo y luego el método.",
  "You need to connect a wallet in order to call them. If you do not have funds to call write methods, do not worry, just go to our": "Necesitas conectar una billetera para poder llamarlos. Si no tienes fondos para llamar a los métodos de escritura, no te preocupes, simplemente ve a nuestro",
  "faucet": "faucet",
  "and get some test FIL.": "y obtén un poco de tokens de prueba FIL.",
  "Methods with arguments": "Métodos con argumentos",
  "Methods with arguments require an input. To check what arguments a method requires, go to the functions file in contract tab.": "Los métodos con argumentos requieren un input. Para chequear qué argumentos requiere un método, poder ir al archivo de funciones en la pestaña 'Contrato'",
  "The input parameter have to be written inside the code block before running the method.": "El parámetro de entrada debe escribirse dentro del bloque de código antes de ejecutar el método.",
  "Click Run!": "Haz clic en el botón 'Ejecutar'",
  "Click the Run method button and wait for the response.": "Haz clic en el botón 'Ejecutar método' y espera la respuesta.",
  "The response will appear in the top right panel. For write methods, the calls will also be displayed in the table.": "La respuesta aparecerá en el panel superior derecho. Para los métodos de escritura, las llamadas también se mostrarán en la tabla.",
  "Press on the code view button on a particular row to view the transaction details.": "Para ver los detalles de la transacción, en la fila que desees presiona el botón de vista de código.",
  "Transaction details": "Detalles de la transacción",
  "Close tutorial": "Cerrar tutorial",
  "Previous": "Previo",
  "Next": "Siguiente",
  "Amount": "Cantidad",
  "Unit": "Unidad",
  "Read Tutorial": "Leer Tutorial",
  "Run Method": "Ejecutar método",
  "Connect Wallet to Run": "Conectar la billetera para ejecutar",
  "Contract": "Contrato",
  "Transaction": "Transacción",
  "Transactions": "Transacciones",
  "All Transactions": "Todas las transacciones",
  "All systems are operational.": "Todos los sistemas están operativos.",
  "Performance affected": "El rendimiento se ve afectado.",
  "Some functionalities are affected and loading times may be increased.": "Algunas funcionalidades están afectadas y los tiempos de carga pueden aumentar.",
  "Encountering Errors": "Se están encontrando errores.",
  "Errors": "Errores",
  "Major parts of the website are affected. Data may not be accurate at the moment.": "Las partes principales del sitio web se ven afectadas. Los datos pueden no ser precisos en este momento.",
  "Check Status": "Verificar estado",
  "Checking status": "Comprobando estado",
  "Cheking...": "Comprobando...",
  "Loading...": "Cargando...",
  "Search in": "Buscar en",
  "FIL price": "Precio de FIL",
  "Latest update": "Última actualización",
  "Average Gas Limit": "Límite de Gas Promedio",
  "Transaction count": "Número de Transacciones",
  "Internal Messages": "Mensajes Internos",
  "Code": "Código",
  "Statistics": "Estadísticas",
  "Interact": "Interactuar",
  "calibration Public RPC Node": "Nodo público RPC de Calibration",
  "mainnet Public RPC Node": "Nodo público RPC de Mainnet",
  "If your project requires data retrieval, you can refer to our publicly available hosted endpoint of Lotus.": "Si tu proyecto requiere recuperación de datos, puedes utilizar nuestro endpoint de Lotus alojado públicamente.",
  "Get Tokens": "Obtener Tokens",
  "Type in your Filecoin address or connect your wallet to receive hyperspace test FIL.": "Ingresa tu address de Filecoin o conecta tu wallet para recibir tokens de prueba FiL de Hyperspace.",
  "Well done! You have connected your wallet. Press the button to receive test FIL.": "Well done! You have connected your wallet. Press the button to receive test FIL.",
  "Try again": "Probar nuevamente",
  "There was an error in the Faucet. Please use the feedback tool on the right to report it.": "Se ha producido un error en Faucet. Utiliza la herramienta de feedback de la derecha para informarlo.",
  "All good. You should receive the tokens soon. Meanwhile, you can track this transaction in the": "Todo bien. Pronto recibirás los tokens. Mientras tanto, puedes seguir esta transacción en",
  "Your transaction:": "Tu transacción:",
  "Disconnect wallet": "Desconectar wallet",
  "Connect wallet": "Conectar wallet",
  "Now you can get test tokens from our Faucet or call write methods from smart contracts.": "Ahora puedes obtener tokens de prueba desde nuestro Faucet e interactuar con métodos de escritura de un smart contract.",
  "Download IPFS": "Descargar IPFS",
  "Compare With": "Comparar con",
  "Please enter a value": "Por favor, introduzca un valor",
  "Invalid characters": "Caracteres inválidos",
  "Sorry! We don't recognize it. Please double check, there might be a typo.": "Lo sentimos. No lo reconocemos. Por favor, verifica nuevamente, podría haber un error tipográfico",
  "Sorry! We don't recognize this address. Please double check, there might be a typo.": "Lo sentimos. No reconocemos la address. Por favor, vuelva a comprobarlo, podría haber un error tipográfico.",
  "Recently viewed": "Recientemente visto",
  "Clear history": "Borrar historial",
  "Zondax understands the importance of protecting and safeguarding your privacy. By using this website you agree with our": "Zondax comprende la importancia de proteger y resguardar tu privacidad. Al utilizar este sitio web, estás de acuerdo con nuestra ",
  "Please select the respective options below. Note that your selection MAY impair some functionality.": "Por favor, selecciona las opciones respectivas a continuación. Ten en cuenta que tu selección PODRÍA afectar algunas funcionalidades",
  "What is a Filecoin address?": "¿Qué es una address de Filecoin?",
  "A Filecoin address is an identifier that represents an actor in the Filecoin network. It encodes information about the network, address type, payload, and includes a checksum.": "Una address de Filecoin es un identificador que representa a un actor en la red de Filecoin. Codifica información sobre la red, tipo de address, payload e incluye una suma de verificación.",
  "How are Filecoin addresses structured?": "¿Cómo están estructuradas las addresses de Filecoin?",
  "All Filecoin addresses start with an f to indicate the network (Filecoin), followed by a prefix number (0, 1, 2, 3, 4) representing the address type.": "Todas las addresses de Filecoin comienzan con una 'f' para indicar la red (Filecoin), y le sigue  un número de prefijo (0, 1, 2, 3, 4) que representa el tipo de address.",
  "What are the different address types in Filecoin?": "¿Cuáles son los diferentes tipos de addresses en Filecoin?",
  "There are five address types in Filecoin: the ones that start with 0 are ID address, with 1 are SECP256K1 public key address, with 2 are actor address, with 3 are BLS public key address and with 4 are extensible, user-defined actor addresses": "Hay cinco tipos de addresses en Filecoin: aquellas que comienzan con 0 son addresses de ID, con 1 son addresses de clave pública SECP256K1, con 2 son addresses de actor, con 3 son addresses de clave pública BLS y con 4 son addresses de actor extensibles y definidas por el usuario.",
  "What is an ID address in Filecoin?": "¿Qué es una address del tipo ID en Filecoin?",
  "An ID address in Filecoin is a short integer assigned to an actor by the InitActor. It represents the actors unique identifier and is prefixed with the network identifier and address type.": "Una address del tipo ID en Filecoin es un número corto asignado a un actor por el InitActor. Representa el identificador único del actor y se le agrega el identificador de red y el tipo de address.",
  "Are actor ID addresses robust in Filecoin?": "¿Las addresses ID de actor en Filecoin son robustas?",
  "Actor ID addresses in Filecoin are not robust as they depend on chain state and can change temporarily after creation in the case of chain reorganizations. However, once the state defining a new ID reaches finality, it becomes bound to that actor permanently.": "Las addresses ID de actor en Filecoin no son robustas, ya que dependen del estado de la cadena y pueden cambiar temporalmente después de su creación en casos donde se realiza una reorganización de la cadena. Sin embargo, una vez que el estado que define un nuevo ID alcanza la finalidad, queda vinculado permanentemente a ese actor.",
  "What are public key addresses in Filecoin?": "¿Qué son las addresses de clave pública en Filecoin?",
  "Public key addresses in Filecoin are derived from a public-private key pair. They provide a way to identify actors and enable signing of messages. Two types of public key addresses are supported: SECP256K1 addresses (starting with f1) and BLS addresses (starting with f3).": "Las addresses de clave pública en Filecoin se derivan de un par de claves pública-privada. Proporcionan una forma de identificar a los actores y permiten la firma de mensajes. Se admiten dos tipos de addresses de clave pública: las addresses SECP256K1 (que comienzan con 'f1') y las addresses BLS (que comienzan con 'f3').",
  "How are actor addresses created in Filecoin?": "¿Cómo se crean las addresses de actor en Filecoin?",
  "Actor addresses in Filecoin are generated by taking a sha256 hash of the output of the account creation. For example, the ZH storage provider has the actor address f2plku564ddywnmb5b2ky7dhk4mb6uacsxuuev3pi and the ID address f01248.": "Las addresses de actor en Filecoin se generan tomando un hash sha256 de la salida de la creación de la cuenta. Por ejemplo, el proveedor de almacenamiento ZH tiene la address del actor 'f2plku564ddywnmb5b2ky7dhk4mb6uacsxuuev3pi' y la address de ID 'f01248'.",
  "What are extensible user-defined actor addresses in Filecoin?": "¿Qué son las addresses de actor extensibles y definidas por el usuario en Filecoin?",
  "Extensible user-defined actor addresses in Filecoin are introduced through the f4 address class, as defined in Filecoin Improvement Proposal (FIP) 0048. They allow for the creation of custom addressing schemes and support interactions with addresses that do not yet exist on-chain.": "Las addresses de actor extensibles y definidas por el usuario en Filecoin se introducen a través de la clase de address f4, según lo definido en la Propuesta de Mejora de Filecoin (FIP) 0048. Permiten la creación de esquemas de direccionamiento personalizados y admiten interacciones con addresses que aún no existen en la cadena.",
  "How are f4 addresses structured in Filecoin?": "¿Cómo están estructuradas las addresses f4 en Filecoin?",
  "An f4 address in Filecoin is structured as f4<address-manager-actor-id>f<new-actor-id>. The <address-manager-actor-id> represents the actor ID of the address manager, and the <new-actor-id> is an arbitrary actor ID chosen by that address manager.": "Una address f4 en Filecoin tiene la estructura 'f4<actor-id-gestor-de-addresses>f<nuevo-id-actor>'. El <actor-id-gestor-de-addresses> representa el ID de actor del gestor de addresses, y el <nuevo-id-actor> es un ID de actor arbitrario elegido por ese gestor de addresses.",
  "Can anyone assign f4 addresses in Filecoin?": "¿Cualquiera puede asignar addresses f4 en Filecoin?",
  "Currently, according to FIP 0048, f4 addresses can only be assigned by specific built-in actors known as address managers. However, it is expected that this restriction will be relaxed in the future, allowing users to deploy custom WebAssembly actors and assign f4 addresses.": "Actualmente, según la FIP 0048, solo los actores integrados específicos conocidos como gestores de addresses pueden asignar addresses f4. Sin embargo, se espera que esta restricción se relaje en el futuro, lo que permitirá a los usuarios implementar actores personalizados de WebAssembly y asignar addresses f4.",
  "What is the Ethereum Address Manager (EAM) in Filecoin?": "¿Qué es el Administrador de Addresses de Ethereum (EAM) en Filecoin?",
  "The Ethereum Address Manager (EAM) is a built-in actor in Filecoin that manages the Ethereum address space within the 410 address namespace. It serves as an EVM smart contract factory and provides methods to create and assign the f410/t410 Filecoin addresses to Ethereum addresses. The f410/t410 address is used for compatibility with Ethereum Virtual Machine (EVM) development tools and applications built on FEVM (Filecoin's EVM implementation).": "El Administrador de Addresses de Ethereum (EAM) es un actor integrado en Filecoin que administra el espacio de addresses Ethereum dentro del espacio de addresses 410. Sirve como una fábrica de contratos inteligentes de EVM (Ethereum Virtual Machine) y proporciona métodos para crear y asignar addresses de Filecoin f410/t410 a addresses de Ethereum. La address f410/t410 se utiliza para la compatibilidad con las herramientas de desarrollo de la Máquina Virtual Ethereum (EVM) y las aplicaciones construidas en FEVM (implementación de EVM de Filecoin).",
  "How does the Ethereum Address Manager assign Filecoin addresses to Ethereum addresses?": "¿Cómo asigna el Administrador de Addresses de Ethereum las addresses de Filecoin a las addresses de Ethereum?",
  "When you have an Ethereum wallet address starting with 0x, the Ethereum Address Manager (EAM) will assign a corresponding t410 Filecoin address to it. For example, if you send 10 TFIL to the Ethereum wallet address 0xd388ab098ed3e84c0d808776440b48f685198498 using a wallet like MetaMask, you will receive 10 TFIL to your t410f2oekwcmo2pueydmaq53eic2i62crtbeyuzx2gmy address on the Filecoin Calibration testnet. Similarly, if you deploy a solidity smart contract on Filecoin Calibration, the EAM will assign a corresponding 0x Ethereum smart contract address, such as 0x5f6044198a16279f87d2839c998893858bbf8d9c, to it. This enables you to interact with the smart contract using Ethereum tooling by referencing the assigned Ethereum smart contract address.": "Cuando tienes una address de billetera Ethereum que comienza con '0x', el Administrador de addresses de Ethereum (EAM) asignará una address de Filecoin t410 correspondiente a ella. Por ejemplo, si envías 10 TFIL a la address de billetera Ethereum '0xd388ab098ed3e84c0d808776440b48f685198498' utilizando una billetera como MetaMask, recibirás 10 TFIL en tu address t410f2oekwcmo2pueydmaq53eic2i62crtbeyuzx2gmy en la testnet de Filecoin Calibration. De manera similar, si implementas un contrato inteligente en Solidity en Filecoin Calibration, el EAM asignará una address de contrato inteligente Ethereum 0x correspondiente, como '0x5f6044198a16279f87d2839c998893858bbf8d9c'. Esto te permitirá interactuar con el contrato inteligente utilizando herramientas de Ethereum haciendo referencia a la address de contrato inteligente Ethereum asignada.",
  "Status": "Estado",
  "Gas Used": "Gas Utilizado",
  "From": "Desde",
  "To": "Hacia",
  "Method": "Método",
  "Parameters": "Parámetros",
  "Type": "Tipo",
  "Information taken from bytecode": "Información tomada de bytecode",
  "Decoding": "Decodificando",
  "Error while decoding ABI. Please upload a file.": "Error al decodificar la ABI. Por favor, carga un archivo.",
  "The number of runs specifies roughly how often each opcode of the deployed code will be executed across the lifetime of the contract.": "El número de ejecuciones especifica aproximadamente con qué frecuencia se ejecutará cada opcode del código deployado a lo largo de la vida útil del contrato.",
  "The number of runs specifies roughly how often each opcode of the deployed code will be executed across the lifetime of the contract. This input is currently disabled and its values is taken from the metadata file. If you'd like to manually set this field, please select: No metadata file.": "El número de ejecuciones especifica aproximadamente con qué frecuencia se ejecutará cada opcode del código deployado a lo largo de la vida útil del contrato. Este campo está actualmente deshabilitado y su valor se toma del archivo de metadatos. Si deseas establecer manualmente este campo, selecciona: no hay archivo de metadatos.",
  "Name of the deployed contract": "Nombre del contrato deployado",
  "Contract files": "Archivos del contrato",
  "Example: [5] or [4,2]. For more information about method parameters, visit the functions file in Code tab.": "Ejemplo: [5] o [4,2]. Para obtener más información sobre los parámetros de los métodos, visita el archivo de funciones en la pestaña de código.",
  "Required for this service to properly run": "Requerido para que este servicio funcione correctamente.",
  "Technical": "Técnico",
  "Analysis cookies": "Cookies de análisis",
  "Help us to improve your experience!": "¡Ayúdanos a mejorar tu experiencia!",
  "Save selection": "Guardar selección",
  "Minimum": "Mínimo",
  "Accept All": "Aceptar todo",
  "Agree": "Acepto",
  "New": "Nuevo",
  "Frequently Asked Questions": "Preguntas Frecuentes",
  "For more information about addresses, please visit": "Para más información sobre direcciones, visite los artículos",
  "Address type": "Address type",
  "Time": "Tiempo",
  "Recent Activity": "Actividad Reciente",
  "Contract Verifier": "Verificador de Contratos",
  "Address Converter": "Conversor de Addresses",
  "Code Snippet": "Snippet de Código",
  "Response": "Respuesta",
  "Home": "Inicio",
  "RPC Node": "Nodo RPC",
  "Explore": "Explorar",
  "Short Address": "Address abreviada/reducida",
  "Actor Type": "Tipo de Actor",
  "No internal messages": "Sin mensajes internos",
  "No transactions": "Sin transacciones",
  "View complete transaction information": "Ver información completa de la transacción",
  "View transaction parameters": "Ver parámetros de la transacción",
  "Download row data": "Descargar datos de la fila",
  "articles from Filecoins documentation.": "de la documentación de Filecoin.",
  "In order to visualize or download the source code, the contract needs to be verified.": "Para visualizar o descargar el código fuente, es necesario verificar el contrato.",
  "ETH Address": "Address de ETH",
  "Actor": "Actor",
  "Balance": "Balance",
  "Creator Address": "Address del creador",
  "Created at": "Creado en",
  "Address": "Address",
  "Contract address in short format": "Address del contrato en formato corto",
  "Address in short format": "Address en formato corto",
  "Contract address in robust format": "Address del contrato en formato robusto",
  "Contract address in Ethereum format": "Address del contrato en formato de Ethereum",
  "Address in Ethereum format": "Address en formato de Ethereum",
  "Account address in robust format": "Address del contrato en formato robusto",
  "Actor type of the account": "Tipo de actor de la cuenta",
  "Tipset Height": "Altura del Tipset",
  "Tipset Hash": "Hash del tipset",
  "Canonical": "Canónico",
  "Indicates whether is part of the canonical chain": "Indica si es parte de la cadena canónica",
  "Indicates the timestamp or time at which the tipset occurred": "Indica la timestamp o el momento en que ocurrió el tipset",
  "Indicates the timestamp or time at which the block occurred": "Indica la timestamp o el momento en que ocurrió el bloque",
  "Parent Block Hash": "Hash del bloque padre",
  "ETH Transaction ID": "ID de transacción ETH",
  "Indicates whether the transaction is part of the canonical chain": "Indica si la transacción forma parte de la cadena canónica",
  "This string describes the status of the transaction, indicating whether it is confirmed, failed or in mempool": "Esta cadena describe el estado de la transacción, indicando si está confirmada, fallida o en la mempool",
  "Value": "Valor",
  "Specifies the type/category/method of the transaction": "Especifica el tipo/categoría/método de la transacción",
  "The value that represents the amount of gas used (attoFIL) in the transaction": "El valor que representa la cantidad de gas utilizado (attoFIL) en la transacción",
  "Is the maximum price that the message sender is willing to pay per unit of gas (measured in attoFIL/gas unit)": "El precio máximo que el remitente del mensaje está dispuesto a pagar por unidad de gas (medido en attoFIL por unidad de gas).",
  "Is measured in units of gas and set by the message sender. It imposes a hard limit on the amount of gas (i.e., number of units of gas) that a message's execution should be allowed to consume on chain": "Se mide en unidades de gas y es establecido por el remitente del mensaje. Impone un límite estricto a la cantidad de gas (es decir, el número de unidades de gas) que la ejecución de un mensaje debería consumir en la cadena.",
  "Is the price per unit of gas (measured in attoFIL/gas) that the message sender is willing to pay (on top of the BaseFee) to “tip” the miner that will include this message in a block": "Es el precio por unidad de gas (medido en attoFIL por gas) que el remitente del mensaje está dispuesto a pagar (además de la Tasa Base) para 'proporcionar incentivo' al minero que incluirá este mensaje en un bloque.",
  "Gas Premium (attoFIL/gas unit)": "Gas Premium(attoFIL por unidad de gas)",
  "Gas Fee Cap (attoFIL/gas unit)": "Límite de Tarifa de Gas (attoFIL por unidad de gas)",
  "Gas Limit (gas units)": "Límite de Gas (unidades de gas)",
  "Overview": "Resumen",
  "Please start by selecting for a type of method and a method": "Por favor, selecciona un tipo de método y un método",
  "Please select a type of method and a method": "Por favor, selecciona un tipo de método y un método",
  "Please specify the amount you want to pay for your transaction. In case you do not know, set the amount to 0.": "Por favor, especifica la cantidad que deseas pagar por tu transacción. En caso de que no lo sepas, establece la cantidad en 0.",
  "No parameters provided": "No se proporcionaron parámetros",
  "Source Code Verified": "Código fuente verificado",
  "The source code we received for this contract is matching the bytecode.": "El código fuente que recibimos para este contrato coincide con el bytecode.",
  "License": "Licencia",
  "Compiler": "Compilador",
  "Compilers": "Compiladores",
  "Constructor Parameters": "Parámetros de construcción",
  "Resources": "Recursos",
  "Smart Contract Examples": "Ejemplos de Contratos Inteligentes",
  "Explore ready-to-use smart contract examples for faster project development.": "Explora ejemplos de contratos inteligentes listos para usar y acelera el desarrollo de proyectos.",
  "Beryx Documentation": "Documentación de Beryx",
  "Comprehensive documentation for Beryx, a powerful development tool for blockchain apps.": "Explora la documentación completa de Beryx, una poderosa herramienta de desarrollo para aplicaciones de blockchain.",
  "Filecoin Deal Client": "Cliente de Acuerdo de Filecoin",
  "Filecoin Deal Client allows users to submit storage deal requests for Filecoin storage providers to pick up": "El Cliente de Acuerdo de Filecoin permite a los usuarios enviar solicitudes de acuerdo de almacenamiento para que los proveedores de almacenamiento de Filecoin las recojan.",
  "Filecoin Market Consumer": "Consumidor del Mercado de Filecoin",
  "Retrieves and stores information about Filecoin storage deals using the 'MarketAPI' library": "Recupera y almacena información sobre los acuerdos de almacenamiento de Filecoin utilizando la biblioteca 'MarketAPI'.",
  "Filecoin Simple Coin": "Filecoin Simple Coin",
  "Token contract with minting, balance mapping, transfers, querying balances, and total supply. Handles insufficient balance and emits minting events.": "Contrato de token con creación, mapeo de saldos, transferencias, consulta de saldos y suministro total. Maneja saldos insuficientes y emite eventos de creación de tokens.",
  "Getting Started": "Primeros pasos",
  "Smart Contracts": "Contratos Inteligentes",
  "Download Contract": "Descargar Contrato",
  "Back": "Atrás",
  "Introduction": "Introducción",
  "Explorer": "Explorador",
  "Accounts": "Cuentas",
  "View More Transactions": "Ver Más Transacciones",
  "View More Tipsets": "Ver Más Tipsets",
  "View More Invokes": "Ver Más Contratos Invocados",
  "mainnet Network Information": "Información de la Red Mainnet",
  "calibration Network Information": "Información de la Red Calibration",
  "CAR File": "Archivo CAR",
  "Reset Timestamp": "Reiniciar Timestamp",
  "Genesis Block CID": "CID del Bloque Génesis",
  "SHA-1 Digest": "SHA-1 Digest",
  "Genesis": "Génesis",
  "Network Parameters": "Parámetros de la Red",
  "Supported Sector Sizes": "Tamaños de Sector Compatibles",
  "Consensus Miner Min Power": "Energía Mínima de Minero del Consenso",
  "Epoch Duration Seconds": "Duración de Época en Segundos",
  "Expected Leaders per Epoch": "Líderes Esperados por Época",
  "WindowPoSt Proving Period": "Período de Suministro de WindowPoSt",
  "WindowPoSt Challenge Window": "Período de Desafío de WindowPoSt",
  "WindowPoSt Period Deadlines": "Fechas Límite del Período de WindowPoSt",
  "Pre-Commit Challenge Delay": "Retraso del Desafío de Pre-commit",
  "Transactions received by the address.": "Transacciones recibidas por la dirección.",
  "Transactions sent from the address.": "Transacciones enviadas desde la dirección.",
  "incoming": "entrante",
  "outgoing": "saliente",
  "Main transactions.": "Transacciones principales.",
  "All transactions, including internal messages.": "Todas las transacciones, incluyendo mensajes internos.",
  "main": "principal",
  "all": "todos",
  "Number of Transactions": "Número de Transacciones",
  "If you don't have a wallet yet, you can select a provider and create one now.": "Si aún no tienes una wallet, puedes seleccionar un proveedor y crear una ahora.",
  "or just track an address": "o simplemente rastrea una address",
  "Track address": "Rastrear dirección",
  "FIL Address:": "Address de FIL",
  "ETH Address:": "Address de ETH",
  "Incoming Txs": "Transacciones entrantes",
  "Outgoing Txs": "Transacciones salientes",
  "Mempool Txs": "Transacciones en Mempool",
  "No incoming transactions yet": "No hay transacciones entrantes aún",
  "No outgoing transactions yet": "No hay transacciones salientes aún",
  "See more in Mempool": "Ver más en Mempool",
  "No transactions in Mempool at the moment": "No hay transacciones en Mempool en este momento",
  "Open wallet": "Abrir billetera",
  "Refresh": "Actualizar",
  "Download Parameters": "Descargar Parámetros",
  "Parameters Table": "Tabla de Parámetros",
  "Switch to Text Input": "Cambiar a Entrada de Texto",
  "Switch to Table Input": "Cambiar a Entrada de Tabla",
  "There are no parameters to complete": "No hay parámetros para completar",
  "You are in tracking mode, not connected to a wallet of this address. In this mode, you can not invoke contracts": "Estas en modo rastreo, no conectado a una billetera de esta dirección. En este modo, no puedes invocar contratos",
  "The account network is linked to the network selector from the top.": "La red de la cuenta está vinculada al selector de red de la parte superior.",
  "You're using the tracking feature and while tracking an address you can't invoke contracts. To interact with contracts please connect a wallet.": "Estás utilizando la función de rastreo y mientras rastreas una dirección no puedes invocar contratos. Para interactuar con los contratos, conecte una billetera.",
  "Perform the search again": "Vuelva a realizar la búsqueda",
  "There is the possibility that your transaction just exited mempool. In this case please try again in 3-4 minutes.": "Existe la posibilidad de que su transacción acabe de salir de mempool. En este caso, inténtelo de nuevo en 3-4 minutos.",
  "Go to home page": "Ir a la página de inicio",
  "Continue your adventure": "Continúa tu aventura",
  "Good news! We found this address in Filecoin mainnet network": "Buenas noticias! Hemos encontrado esta address en la red mainnet de Filecoin",
  "Good news! We found this address in Filecoin calibration network": "Buenas noticias! Hemos encontrado esta address en la red calibration de Filecoin",
  "Good news! We found this transaction in Filecoin mainnet network": "Buenas noticias! Hemos encontrado esta transacción en la red mainnet de Filecoin",
  "Good news! We found this transaction in Filecoin calibration network": "Buenas noticias! Hemos encontrado esta transacción en la red calibration de Filecoin",
  "We couldn’t find the address in any network": "No pudimos encontrar la address en ninguna red",
  "We couldn’t find the transaction in any network": "No pudimos encontrar la transacción en ninguna red",
  "This tipset has not been created yet.": "Este tipset aún no se ha creado.",
  "The latest tipset is": "El último tipset es",
  "tipset Not Found": "Tipset no encontrado",
  "address Not Found": "Address no encontrada",
  "transaction Not Found": "Transacción no encontrada",
  "Page Not Found": "Página no encontrada",
  "To report a bug please use the Feedback tool from the right side of the screen.": "Para informar de un error, utilice la herramienta de comentarios de la parte derecha de la pantalla.",
  "Full Transaction Details": "Detalles Completos de la Transacción",
  "Decoded Parameters": "Parámetros Decodificados",
  "Find us at FIL Dev Summit 2023 Iceland": "Encuéntranos en FIL Dev Summit 2023 Islandia",
  "Interact with Smart Contracts": "Interactúa con Contratos Inteligentes",
  "Explore the functionalities of your Smart Contract. Invoke methods, set input parameters, transfer tokens, interpret ABI, and examine the source code.": "Explora las funcionalidades de tu Contrato Inteligente. Invoca métodos, establece parámetros de entrada, transfiere tokens, interpreta la ABI y examina el código fuente.",
  "The address parameter requires an Ethereum address": "El parámetro de dirección requiere una dirección de Ethereum",
  "Rich List": "Cuentas más ricas",
  "Top Accounts By Gas Used": "Cuentas Principales por Gas Utilizado",
  "Top Contracts By Unique Users": "Contratos Principales por Usuarios Únicos",
  "Top Contracts By Invokes": "Contratos Principales por Invocaciones",
  "Sorry! We don't have this functionality for mobile version. Please try it on desktop version.": "Lo sentimos. No tenemos esta funcionalidad para la versión móvil. Por favor, inténtelo en versión de escritorio.",
  "Gas Used in the Current Week": "Gas Consumido en la Semana en Curso",
  "Avg. Gas Used in the Past Day": "Promedio de Gas Consumido en el Día Anterior",
  "Daily Gas Consumption": "Consumo Diario de Gas",
  "Daily Contract Creates": "Contratos Diarios Creados",
  "Total Number of Contracts": "Número Total de Contratos",
  "Number of Contracts Created in the Current Day": "Número de Contratos Creados en el Día en Curso",
  "Number of Contracts Created in the Current Week": "Número de Contratos Creados en la Semana en Curso",
  "Compared to Last Week": "En Comparación con la Última Semana",
  "Number of Contract Invokes in the Current Day": "Número de Contratos Invocados en el Día en Curso",
  "Number of Contract Invokes in the Current Week": "Número de Contratos Invocados en la Semana en Curso",
  "Daily Contract Invokes": "Contratos Diarios Invocados",
  "We couldn't find the data. Please try later.": "No hemos podido encontrar los datos. Por favor, inténtelo más tarde.",
  "7 Days": "7 Días",
  "30 Days": "30 Días",
  "All": "Todo",
  "Contracts": "Contratos",
  "Meet us at": "Nos encontramos en",
  "There is no data in this time range": "No hay datos en este rango de tiempo",
  "Account Balance Change": "Cambio en el Saldo de la Cuenta",
  "Notifications": "Notificaciones",
  "Clear All": "Borrar Todo",
  "There are no notifications": "No hay notificaciones",
  "No opened files": "No hay archivos abiertos",
  "Interact feature is available only on desktop": "La función Interact sólo está disponible en versión de escritorio",
  "Incoming transaction successfully sent to this address.": "Transacción entrante exitosamente enviada desde esta dirección.",
  "Incoming transaction sent with error to this address.": "Transacción entrante enviada con error desde esta dirección.",
  "Outgoing transaction successfully sent from this address.": "Transacción saliente exitosamente enviada desde esta dirección.",
  "Outgoing transaction sent with error from this address.": "Transacción saliente enviada con error desde esta dirección.",
  "Hide internal messages": "Ocultar mensajes internos",
  "Show internal messages": "Mostrar mensajes internos",
  "Block": "Bloque",
  "Due to the abundance of transactions associated with this address, the display of all entries has been disabled. Please choose between viewing incoming transactions or outgoing transactions.": "Debido a la abundancia de transacciones asociadas con esta dirección, se ha desactivado la visualización de todas las entradas. Por favor, elija entre ver las transacciones entrantes o las transacciones salientes.",
  "Indicates the CID of the parent tipset": "Indica el CID del tipset padre",
  "Indicates the total number of transactions in the tipset. Internal messages are not included.": "Indica el número total de transacciones en el tipset. No se incluyen los mensajes internos.",
  "Is the set price per unit of gas (measured in attoFIL/gas unit) to be burned (sent to an unrecoverable address) for every message execution.": "Es el precio fijado por unidad de gas (medido en attoFIL/unidad de gas) que se quemará (enviado a una address irrecuperable) por cada ejecución de mensaje.",
  "Parent Base Fee": "Parent Base Fee",
  "Parent Tipset CID": "CID del Tipset padre",
  "At the moment, this address has no transactions in mempool.": "En este momento, esta address no tiene transacciones en mempool.",
  "Transaction Metadata": "Metadata de la Transacción",
  "Transaction Parameters": "Parámetros de la Transacción",
  "Represents the overall count of transactions associated with the contract. This count excludes internal messages.": "Representa el recuento total de transacciones asociadas con el contrato. Este recuento excluye los mensajes internos.",
  "Specifies the total count of transactions within the block. Internal messages are excluded from this count.": "Especifica el recuento total de transacciones dentro del bloque. Los mensajes internos están excluidos.",
  "Specifies the overall count of transactions sent and received by the address. Internal messages are not accounted for in this total.": "Especifica el recuento total de transacciones enviadas y recibidas por la dirección. Los mensajes internos no se tienen en cuenta en este total.",
  "Check out the upcoming events": "Consulta los próximos eventos",
  "In mempool": "En mempool",
  "Transaction is being processed": "La transacción está siendo procesada",
  "Total Gas Consumption": "Consumo Total de Gas",
  "Gas Consumption": "Consumo de Gas",
  "Number of Received Transactions": "Número de Transacciones Recibidas",
  "Number of Sent Transactions": "Número de Transacciones Enviadas",
  "Total Number of Transactions": "Número Total de Transacciones",
  "Number of Contract Invokes": "Número de Invocaciones de Contratos",
  "Number of Contracts Creates": "Número de Creaciones de Contratos",
  "Stats": "Estadísticas",
  "Gas Fee Premium": "Tarifa de Gas Premium",
  "Gas Limit": "Límite de Gas",
  "Gas Fee Cap": "Tarifa Máxima de Gas",
  "Confirmation Time": "Tiempo de Confirmación",
  "Transactions Type": "Tipos de Transacciones",
  "Current": "Current",
  "Past Hour": "Past Hour",
  "Past Day": "Past Day",
  "Past Week": "Past Week",
  "Cheers to a year full of accomplishments": "Brindemos por un año lleno de logros",
  "Start exploring the Filecoin Network.": "Comienza a explorar la red Filecoin.",
  "2023 RECAP": "RESUMEN 2023",
  "Q1": "T1",
  "A Tool for Devs": "Una herramienta para desarrolladores",
  "Support for Testnet": "Soporte para Testnet",
  "Smart Contract Decoding": "Decodificación de contratos inteligentes",
  "Smart Contract Interaction": "Interacción con contratos inteligentes",
  "Q2": "T2",
  "FVM Mainnet Launch": "Lanzamiento de FVM Mainnet",
  "RPC Node Calibration": "Nodo RPC en Calibration",
  "Faucet": "Faucet",
  "Wallet Support": "Soporte de billetera",
  "Q3": "T3",
  "Stability and Speed": "Estabilidad y velocidad",
  "Leaderboard": "Tabla de líderes",
  "Mempool Data": "Datos de Mempool",
  "Resources for Devs": "Recursos para desarrolladores",
  "Search History": "Historial de búsqueda",
  "Multiple Language Support": "Soporte multilingüe",
  "Q4": "T4",
  "Statistics and Fine Tuning": "Estadísticas y ajustes",
  "Dashboards": "Estadísticas",
  "Mempool Stats": "Estadísticas de Mempool",
  "Statistics for Addresses, Block, Contract": "Estadísticas para direcciones, bloques, contratos",
  "Transaction Logs": "Registros de transacciones",
  "Interacting with this network is currently not feasible.": "En la actualidad, no es posible interactuar con esta red.",
  "Please try again later or use the feedback tool on the right to report it.": "Por favor, inténtalo de nuevo más tarde o utiliza la herramienta de feedback a la derecha para informarlo.",
  "Please try again or use the feedback tool on the right to report it.": "Por favor, inténtalo de nuevo o utiliza la herramienta de feedback a la derecha para informarlo.",
  "Closest match": "Coincidencia más cercana",
  "Source code not available": "Código fuente no disponible",
  "Base Fee": "Tarifa Base",
  "Global Base Fee statistics for a specified period.": "Estadísticas globales de tarifas base para un período específico.",
  "Global Base Fee": "Tarifa Global Base",
  "Gas Estimator": "Estimador de gas",
  "Find out what are the chances to get in the next block. Please choose a method as gas prices vary depending on the method. A block is created every 30 seconds.": "Descubre cuáles son las posibilidades para entrar en el siguiente bloque. Elija un método, ya que los precios del gas varían según el método. Se crea un bloque cada 30 segundos.",
  "Probability to get in the next block": "Probabilidad de entrar en el siguiente bloque",
  "Low": "Baja",
  "Medium": "Media",
  "High": "Alta",
  "chances to get in the next block": "de posibilidad de entrar en el siguiente bloque",
  "Gas Premium": "Gas Premium",
  "Pricing data provider by": "Proveedor de datos de precios proporcionado por"
}
